package main

import (
	"fmt"
	"patterns/builder"
	"patterns/facade"
	"patterns/factory"
)

func main() {
	fmt.Println("============== [Паттерны проектирования] ==============")
	fmt.Println("\n==================== [Порождающие] ====================")
	fmt.Println("================== 1. [Строитель] =====================")
	builder.Builder()
	fmt.Println("================== 2. [Фабрика] =====================")
	factory.Factory()

	fmt.Println("\n==================== [Структурные] ====================")
	fmt.Println("===================== 1. [Фасад] ======================")
	facade.Facade()

	fmt.Println("\n==================== [Поведенческие] ====================")
	fmt.Println("==================== 1. [Комманда] ======================")
	fmt.Println("================ 2. [Цепочка вызовов] ===================")
	fmt.Println("=================== 3. [Посетитель] =====================")
	fmt.Println("==================== 4. [Состояние] =====================")
	fmt.Println("==================== 5. [Стратегия] =====================")
}
